Repository: skiddie0057/Mi-Create-Lite
Catalog: src/locales/*/LC_MESSAGES/main.po
Languages: it, ru, uk

source: You have unsaved project(s) open. Save and quit?
it: Hai progetti aperti non salvati. Vuoi salvarli e uscire?
ru: Открыт(ы) несохраненный(-ные) проект(ы). Сохранить и выйти?
uk: У Вас є відкриті незбережені дані. Зберегти та вийти?

source: An urgent update {version} was released! The app will now update.
it: È stato rilasciato un aggiornamento urgente {version}! L'applicazione verrà ora aggiornata.
ru: Выпущено срочное обновление {version}! Приложение будет обновлено.
uk: Вийшло термінове оновлення {version}! Програму буде оновлено.

source: A new update has been found ({version}). Would you like to update now?
it: È stato trovato un nuovo aggiornamento ({version}). Vuoi aggiornare ora?
ru: Найдено новое обновление ({version}). Хотите установить сейчас?
uk: Знайдено оновлення ({version}). Встановити оновлення зараз?

source: Widget {shape} not implemented in ObjectIcon(), please report as issue.
it: Il widget {shape} non è implementato in ObjectIcon(), segnala il problema.
ru: Виджет {shape} не реализован в ObjectIcon(). Пожалуйста, сообщите об этом как о проблеме.
uk: Віджет {shape} у ObjectIcon() не реалізований. Повідомте як про проблему.

source: Failed to obtain currentItem
it: Impossibile ottenere l'elemento corrente
ru: Не удалось получить currentItem
uk: Збій отримання поточного елементу currentItem

source: No object found in widget list that has the name of currently selected graphics item:
it: Nessun oggetto trovato nell'elenco dei widget che abbia il nome dell'elemento grafico attualmente selezionato:
ru: В списке виджетов не найдено объекта с именем выбранного в данный момент графического элемента:
uk: У списку віджетів не знайдено жодного об'єкта з назвою обраного графічного елемента:

source: Error occured during property update: Object not found!
it: Si è verificato un errore durante l'aggiornamento della proprietà: oggetto non trovato!
ru: Возникла ошибка при обновлении свойств: Объект не найден!
uk: Під час оновлення властивостей виникла помилка: Об'єкт не знайдений!

source: Unable to find
it: Non trovato!
ru: Найти не удалось
uk: Знайти не вийшло

source: Select Folder...
it: Seleziona cartella...
ru: Выберите папку...
uk: Обрати теку...

source: Add Image...
it: Aggiungi immagine...
ru: Добавить изображение...
uk: Додати зображення...

source: Are you sure you want to reset all dock widget positions?
it: Vuoi davvero reimpostare tutte le posizioni dei widget ?
ru: Вы уверены, что хотите сбросить все позиции виджетов?
uk: Ви дійсно хочете скинути усі позиції віджета?

source: Are you sure you want to create your project in the directory of this program?
it: Sei sicuro di voler creare il tuo progetto nella cartella di questo programma ?
ru: Вы уверены, что хотите создать свой проект в каталоге этой программы?
uk: Ви дійсно хочете створити свій проєкт у теці цієї програми?

source: Failed to createNewWorkspace:
it: Impossibile creare una nuova area di lavoro:
ru: Не удалось создать новое рабочее пространство:
uk: Збій створення нового робочого простору:

source: Cannot open project:
it: Impossibile aprire il progetto:
ru: Невозможно открыть проект:
uk: Неможливо відкрити проєкт:

source: Failed to create a new project:
it: Impossibile creare un nuovo progetto:
ru: Не удалось создать новый проект:
uk: Збій створення нового проєкту:

source: Open Project...
it: Progetto aperto...
ru: Открыть проект...
uk: Відкрити проєкт...

source: Failed to open project:
it: Impossibile aprire il progetto:
ru: Не удалось открыть проект:
uk: Збій відкриття проєкту:

source: Failed to save:
it: Impossibile salvare:
ru: Не удалось сохранить:
uk: Збій збереження:

source: Failed to save project:
it: Impossibile salvare il progetto:
ru: Не удалось сохранить проект:
uk: Збій збереження проєкту:

source: Project saved at
it: Progetto salvato in
ru: Проект сохранен в
uk: Проєкт збережений о

source: Save project before building?
it: Salvare il progetto prima di compilare ?
ru: Сохранить проект до начала сборки?
uk: Зберегти проєкт перед збиранням?

source: Create Widget
it: Crea widget
ru: Создать виджет
uk: Створити віджет
